lwray-renesas/Metrology_NPL_3Ph4W/src/rl78i1c/libwrapper/metrology/wrp_em_adc.c
/***********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products.
 * No other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIESREGARDING THIS SOFTWARE, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
 * NON-INFRINGEMENT.  ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED.TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY
 * LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES SHALL BE LIABLE FOR ANY DIRECT,
 * INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR
 * ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability
 * of this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2013, 2015 Renesas Electronics Corporation. All rights reserved.
 ***********************************************************************************************************************/

/***********************************************************************************************************************
 * File Name    : wrp_em_adc.c
 * Version      : 1.01
 * Device(s)    : RL78/I1C - 512K
 * Tool-Chain   : CCRL
 * H/W Platform : RL78/I1C Energy Meter Platform
 * Description  : ADC Wrapper for RL78/I1C - 512K Platform
 ***********************************************************************************************************************/

/***********************************************************************************************************************
Includes   <System Includes> , "Project Includes"
 ***********************************************************************************************************************/
/* Driver */
#include "r_cg_macrodriver.h"
#include "r_cg_dsadc.h"
#include "r_cg_dtc.h"

/* Standard library */
#include <string.h>

/* Other EM wrapper */
#include "wrp_em_sw_config.h"   /* Wrapper Shared Configuration */
#include "wrp_em_adc.h"         /* Wrapper ADC definitions */
#include "em_core.h"
#include "platform.h"
#include "r_calib.h"

/* Filter middleware */
#include "rl78_sw_hpf16.h"
#include "r_dscl_iirbiquad_i32_1.h"
#include "r_dscl_iirbiquad_i32_2.h"

/******************************************************************************
Typedef definitions
 ******************************************************************************/

/******************************************************************************
Macro definitions
 ******************************************************************************/
/* User definition */
#define EM_FAC_CHANGED_DETECTION_COUNT                              (5)

/* Non user definition */
#define EM_ADC_CHANNEL_RESULT_REG_ADDR_CURRENT_PHASE_R              (&(JOIN(DSADCR, EM_ADC_CURRENT_DRIVER_CHANNEL_OPTIMIZATION_PHASE_R)))
#define EM_ADC_CHANNEL_RESULT_REG_ADDR_CURRENT_PHASE_Y              (&(JOIN(DSADCR, EM_ADC_CURRENT_DRIVER_CHANNEL_OPTIMIZATION_PHASE_Y)))
#define EM_ADC_CHANNEL_RESULT_REG_ADDR_CURRENT_PHASE_B              (&(JOIN(DSADCR, EM_ADC_CURRENT_DRIVER_CHANNEL_OPTIMIZATION_PHASE_B)))
#define EM_ADC_CHANNEL_RESULT_REG_ADDR_CURRENT_NEUTRAL              (&(JOIN(DSADCR, EM_ADC_CURRENT_DRIVER_CHANNEL_OPTIMIZATION_NEUTRAL)))

#define EM_ADC_DRIVER_CURRENT_READ_ONE_CHANNEL(isample, dsad_reg)   {\
		*((uint16_t *)&isample)         = *((uint16_t *)dsad_reg);\
		*((uint8_t *)&isample + 0x02)   = *((uint8_t *)dsad_reg + 0x02);\
		*((int8_t *)&isample + 0x03)    = (*((int8_t *)dsad_reg + 0x02)) >> 7;\
}

#define EM_ADC_DRIVER_CURRENT_READ_ALL()                            {\
		EM_ADC_DRIVER_CURRENT_READ_ONE_CHANNEL(g_wrp_adc_samples.phase_r.i, EM_ADC_CHANNEL_RESULT_REG_ADDR_CURRENT_PHASE_R);\
		EM_ADC_DRIVER_CURRENT_READ_ONE_CHANNEL(g_wrp_adc_samples.phase_y.i, EM_ADC_CHANNEL_RESULT_REG_ADDR_CURRENT_PHASE_Y);\
		EM_ADC_DRIVER_CURRENT_READ_ONE_CHANNEL(g_wrp_adc_samples.phase_b.i, EM_ADC_CHANNEL_RESULT_REG_ADDR_CURRENT_PHASE_B);\
		EM_ADC_DRIVER_CURRENT_READ_ONE_CHANNEL(g_wrp_adc_samples.neutral.i, EM_ADC_CHANNEL_RESULT_REG_ADDR_CURRENT_NEUTRAL);\
}

/******************************************************************************
Imported global variables and functions (from other files)
 ******************************************************************************/

/******************************************************************************
Exported global variables and functions (to be accessed by other files)
 ******************************************************************************/

/******************************************************************************
Private global variables and functions
 ******************************************************************************/

/* Software delay for voltage channel */
#if (EM_ADC_DELAY_STEP_VOLTAGE > 0)

int16_t     g_wrp_adc_voltage_circle_pos; 
uint16_t    g_wrp_adc_voltage_circle_step;

int16_t g_wrp_adc_voltage_circle_phase_r[EM_ADC_DELAY_STEP_VOLTAGE+1];
int16_t g_wrp_adc_voltage_circle_phase_y[EM_ADC_DELAY_STEP_VOLTAGE+1];
int16_t g_wrp_adc_voltage_circle_phase_b[EM_ADC_DELAY_STEP_VOLTAGE+1];

#endif /* EM_ADC_DELAY_STEP_VOLTAGE > 0 */
#ifdef METER_WRAPPER_ADC_COPY_REACTIVE_SAMPLE
#if (EM_ADC_DELAY_VOLTAGE90_MAX_STEP > 0)

int16_t     g_wrp_adc_voltage90_circle_pos; 
uint16_t    g_wrp_adc_voltage90_circle_step;

int16_t g_wrp_adc_voltage90_circle_phase_r[EM_ADC_DELAY_VOLTAGE90_MAX_STEP+1];
int16_t g_wrp_adc_voltage90_circle_phase_y[EM_ADC_DELAY_VOLTAGE90_MAX_STEP+1];
int16_t g_wrp_adc_voltage90_circle_phase_b[EM_ADC_DELAY_VOLTAGE90_MAX_STEP+1];

#endif /* METER_WRAPPER_ADC_COPY_REACTIVE_SAMPLE */
#endif /* EM_ADC_DELAY_VOLTAGE90_MAX_STEP > 0 */

/* 16bit of voltage sample, no struct for optimization */
int16_t g_wrp_adc_buffer_phase_r_v;
int16_t g_wrp_adc_buffer_phase_y_v;
int16_t g_wrp_adc_buffer_phase_b_v;

