lwray-renesas/Metrology_NPL_3Ph4W/src/rl78i1c/libwrapper/metrology/wrp_em_adc.c
int16_t g_wrp_adc_buffer_phase_r_v90;
int16_t g_wrp_adc_buffer_phase_y_v90;
int16_t g_wrp_adc_buffer_phase_b_v90;

/* Intermediate capture data for checking only */
uint16_t g_wrp_adc_calculated_tdr;

/* Sample storage of wrapper */
EM_SAMPLES g_wrp_adc_samples;

#ifdef __DEBUG
volatile uint16_t g_wrp_sample_count = EM_ADC_MAX_DEBUG_SAMPLE;
int16_t  g_wrp_sample_int16[6][EM_ADC_MAX_DEBUG_SAMPLE];
int32_t  g_wrp_sample_int32[4][EM_ADC_MAX_DEBUG_SAMPLE];

#ifdef LPF_TEST

/* Low pass filter - normalised version of: https://en.wikipedia.org/wiki/Low-pass_filter*/

// y = a*RAW + (1 - a)Y_previous;
//
// Normalising for integer arithemtic (normalising to mutliplcation by 8)
// a = 8/0.8 = 10
// 1-a = 8/1-0.8 = 40
//
// Normalised the LPF looks like:
// y = ((RAW * 8)/10) + ((Y_previous * 8)/40)

int32_t  voltage;
int32_t  voltage_previous;
const int32_t alpha = 16;
const int32_t one_minus_alpha = 16;
int16_t  g_wrp_sample_vr_int16_lpf[EM_ADC_MAX_DEBUG_SAMPLE];

volatile int32_t gradient = 0;
volatile int32_t gradient_count = 0;
volatile int32_t us_to_next_zc = 0;
volatile uint8_t direction = 0U;
volatile uint8_t saved_direction = 0U;
volatile int32_t abs_voltage;
volatile int32_t abs_voltage_previous;
volatile uint8_t timer_running = 0U;
volatile uint16_t final_delay = 0U;

#endif

#endif /* __DEBUG */

uint8_t g_EM_ADC_GainPhaseCurrentLevel[EM_VOL_CHANNEL_NUM];        /* The current level of phase gain */

dsad_gain_t g_wrp_adc_channel_gain[EM_VOL_CHANNEL_NUM][EM_GAIN_PHASE_NUM_LEVEL_MAX] = 
{
		{
				EM_ADC_GAIN_LEVEL0_PHASE_R,
				EM_ADC_GAIN_LEVEL1_PHASE_R,
		},
		{
				EM_ADC_GAIN_LEVEL0_PHASE_Y,
				EM_ADC_GAIN_LEVEL1_PHASE_Y,
		},
		{
				EM_ADC_GAIN_LEVEL0_PHASE_B,
				EM_ADC_GAIN_LEVEL1_PHASE_B,
		},
};

/* Reactive timer */
float32_t g_previous_fac;
uint8_t g_fac_update_counter = 0;

/* Linear interpolation for reactive sample at un-settable TDR01 value */
int16_t  g_wrp_adc_v90_lerp_t;
int16_t * gp_previous_v90_r;
int16_t * gp_previous_v90_y;
int16_t * gp_previous_v90_b;

/******************************************************************************
 * Function Name    : void EM_ADC_SetGainEnum(EM_LINE line, dsad_gain_t dsad_gain)
 * Description      : Set a suitable gain phase level to a port
 * Arguments        : None
 * Functions Called : None
 * Return Value     : None
 ******************************************************************************/
void EM_ADC_SetGainEnum(EM_LINE line, dsad_gain_t dsad_gain)
{
	switch (line)
	{
	case LINE_PHASE_R:
		R_DSADC_SetChannelGain(EM_ADC_CURRENT_DRIVER_CHANNEL_PHASE_R, dsad_gain);
		break;
	case LINE_PHASE_Y:
		R_DSADC_SetChannelGain(EM_ADC_CURRENT_DRIVER_CHANNEL_PHASE_Y, dsad_gain);
		break;
	case LINE_PHASE_B:
		R_DSADC_SetChannelGain(EM_ADC_CURRENT_DRIVER_CHANNEL_PHASE_B, dsad_gain);
		break;
	case LINE_NEUTRAL:
		R_DSADC_SetChannelGain(EM_ADC_CURRENT_DRIVER_CHANNEL_NEUTRAL, dsad_gain);
		break;
	default:
		break;
	}
}

/******************************************************************************
 * Function Name    : void EM_ADC_GainPhaseSet(EM_LINE line, uint8_t gain)
 * Description      : Set a suitable gain phase level to a port
 * Arguments        : None
 * Functions Called : None
 * Return Value     : None
 ******************************************************************************/
void EM_ADC_SetGainValue(EM_LINE line, uint8_t gain)
{
	dsad_gain_t dsad_gain = R_DSADC_GetGainEnumValue(gain);

	EM_ADC_SetGainEnum(line, dsad_gain);
}

/******************************************************************************
 * Function Name    : static void EM_ADC_DoPhaseDelayAllVoltage(void)
 * Description      : Do phase delay for all voltage samples accordingly
 * Arguments        : None
 * Functions Called : None
 * Return Value     : None
 ******************************************************************************/
static void EM_ADC_DoPhaseDelayAllVoltage(void)
{
	int16_t pop_pos;

	/* Phase adjustment for V signal */
#if (EM_ADC_DELAY_STEP_VOLTAGE > 0)
	if (g_wrp_adc_voltage_circle_pos <= 0)
	{
		pop_pos = g_wrp_adc_voltage_circle_step;
	}
	else
	{
		pop_pos = g_wrp_adc_voltage_circle_pos - 1;
	}

	/* PUSH: Add the signal into the data circle at circlepos position */
	g_wrp_adc_voltage_circle_phase_r[g_wrp_adc_voltage_circle_pos] = g_wrp_adc_buffer_phase_r_v;
	g_wrp_adc_voltage_circle_phase_y[g_wrp_adc_voltage_circle_pos] = g_wrp_adc_buffer_phase_y_v;
	g_wrp_adc_voltage_circle_phase_b[g_wrp_adc_voltage_circle_pos] = g_wrp_adc_buffer_phase_b_v;

	/* POP: Get the signal from data circle from (pos + steps) position */
	g_wrp_adc_buffer_phase_r_v = g_wrp_adc_voltage_circle_phase_r[pop_pos];
	g_wrp_adc_buffer_phase_y_v = g_wrp_adc_voltage_circle_phase_y[pop_pos];
	g_wrp_adc_buffer_phase_b_v = g_wrp_adc_voltage_circle_phase_b[pop_pos];

	/* Scroll the circle, scroll left */
	g_wrp_adc_voltage_circle_pos--;
	if (g_wrp_adc_voltage_circle_pos == -1)
	{
		g_wrp_adc_voltage_circle_pos = g_wrp_adc_voltage_circle_step;
	}

#endif /* EM_ADC_DELAY_STEP_VOLTAGE > 0 */

#ifdef METER_WRAPPER_ADC_COPY_REACTIVE_SAMPLE
	/* Phase adjustment for V90 signal */
#if (EM_ADC_DELAY_VOLTAGE90_MAX_STEP > 0)
	if (g_wrp_adc_voltage90_circle_pos <= 0)
	{
		pop_pos = g_wrp_adc_voltage90_circle_step;
	}
	else
	{
		pop_pos = g_wrp_adc_voltage90_circle_pos - 1;
	}

	/* PUSH: Add the signal into the data circle at circlepos position */
	g_wrp_adc_voltage90_circle_phase_r[g_wrp_adc_voltage90_circle_pos] = g_wrp_adc_buffer_phase_r_v90;
	g_wrp_adc_voltage90_circle_phase_y[g_wrp_adc_voltage90_circle_pos] = g_wrp_adc_buffer_phase_y_v90;
	g_wrp_adc_voltage90_circle_phase_b[g_wrp_adc_voltage90_circle_pos] = g_wrp_adc_buffer_phase_b_v90;

	/* Backup pushID for interpolation with next DSAD->SAR sample */
	gp_previous_v90_r = &g_wrp_adc_voltage90_circle_phase_r[g_wrp_adc_voltage90_circle_pos];
	gp_previous_v90_y = &g_wrp_adc_voltage90_circle_phase_y[g_wrp_adc_voltage90_circle_pos];
	gp_previous_v90_b = &g_wrp_adc_voltage90_circle_phase_b[g_wrp_adc_voltage90_circle_pos];

	/* POP: Get the signal from data circle from (pos + steps) position */
	g_wrp_adc_buffer_phase_r_v90 = g_wrp_adc_voltage90_circle_phase_r[pop_pos];
	g_wrp_adc_buffer_phase_y_v90 = g_wrp_adc_voltage90_circle_phase_y[pop_pos];
	g_wrp_adc_buffer_phase_b_v90 = g_wrp_adc_voltage90_circle_phase_b[pop_pos];

	/* Scroll the circle, scroll left */
	g_wrp_adc_voltage90_circle_pos--;
	if (g_wrp_adc_voltage90_circle_pos == -1)
	{
		g_wrp_adc_voltage90_circle_pos = g_wrp_adc_voltage90_circle_step;
	}
#endif /* EM_ADC_DELAY_VOLTAGE90_MAX_STEP > 0 */

#endif /* METER_WRAPPER_ADC_COPY_REACTIVE_SAMPLE */

