lwray-renesas/Metrology_NPL_3Ph4W/src/rl78i1c/libwrapper/metrology/wrp_em_adc.c
}
/******************************************************************************
 * Function Name    : static void EM_ADC_DoPhaseDelayAllCurrent(void)
 * Description      : Do phase delay for all current samples accordingly
 * Arguments        : None
 * Functions Called : None
 * Return Value     : None
 ******************************************************************************/
static void EM_ADC_DoPhaseDelayAllCurrent(void)
{
	/* Not implement for current channel */
}

/******************************************************************************
 * Function Name    : static void EM_ADC_DoNoisyBitMasking(void)
 * Description      : Do noisy bit masking for signals
 * Functions Called : None
 * Return Value     : None
 ******************************************************************************/
static void EM_ADC_DoNoisyBitMasking(void)
{
#ifdef EM_ENABLE_NOISY_BIT_MASKING

	int16_t i_mask;

	/* Find the mask of I for noisy bit clearing
	 * Note: do not use this on SAR 10bit signal
	 */

	/* Phase_R */
	i_mask = ((int16_t)(g_wrp_adc_samples.phase_r.i >> 16));

	if (i_mask == 0x0000)
	{
		/* Mask off the noise, 4 low-bits */
#ifdef EM_MASK_OFF_NOISY_BITS_POSITIVE
		*((uint8_t *)&g_wrp_adc_samples.phase_r.i) &= EM_MASK_OFF_NOISY_BITS_POSITIVE;
#endif /* EM_MASK_OFF_NOISY_BITS_POSITIVE */
	}
	else if (i_mask == 0xffff)
	{
		/* Mask off the noise, 4 low-bits */
#ifdef EM_MASK_OFF_NOISY_BITS_NEGATIVE
		*((uint8_t *)&g_wrp_adc_samples.phase_r.i) |= EM_MASK_OFF_NOISY_BITS_NEGATIVE;
#endif /* EM_MASK_OFF_NOISY_BITS_NEGATIVE */
	}

	/* Phase_Y */
	i_mask = ((int16_t)(g_wrp_adc_samples.phase_y.i >> 16));

	if (i_mask == 0x0000)
	{
		/* Mask off the noise, 4 low-bits */
#ifdef EM_MASK_OFF_NOISY_BITS_POSITIVE
		*((uint8_t *)&g_wrp_adc_samples.phase_y.i) &= EM_MASK_OFF_NOISY_BITS_POSITIVE;
#endif /* EM_MASK_OFF_NOISY_BITS_POSITIVE */
	}
	else if (i_mask == 0xffff)
	{
		/* Mask off the noise, 4 low-bits */
#ifdef EM_MASK_OFF_NOISY_BITS_NEGATIVE
		*((uint8_t *)&g_wrp_adc_samples.phase_y.i) |= EM_MASK_OFF_NOISY_BITS_NEGATIVE;
#endif /* EM_MASK_OFF_NOISY_BITS_NEGATIVE */
	}

	/* Phase_B */
	i_mask = ((int16_t)(g_wrp_adc_samples.phase_b.i >> 16));

	if (i_mask == 0x0000)
	{
		/* Mask off the noise, 4 low-bits */
#ifdef EM_MASK_OFF_NOISY_BITS_POSITIVE
		*((uint8_t *)&g_wrp_adc_samples.phase_b.i) &= EM_MASK_OFF_NOISY_BITS_POSITIVE;
#endif /* EM_MASK_OFF_NOISY_BITS_POSITIVE */
	}
	else if (i_mask == 0xffff)
	{
		/* Mask off the noise, 4 low-bits */
#ifdef EM_MASK_OFF_NOISY_BITS_NEGATIVE
		*((uint8_t *)&g_wrp_adc_samples.phase_b.i) |= EM_MASK_OFF_NOISY_BITS_NEGATIVE;
#endif /* EM_MASK_OFF_NOISY_BITS_NEGATIVE */
	}

#endif /* EM_ENABLE_NOISY_BIT_MASKING */
}

/******************************************************************************
 * Function Name    : void EM_ADC_Init(void)
 * Description      : Set a suitable gain neutral level to a port
 * Arguments        : None
 * Functions Called : EM_ADC_DriverInit()
 * Return Value     : None
 ******************************************************************************/
void EM_ADC_Init(void)
{
	/* Init ADC HW Module */

	/* Initialize ADC Data */
	memset((void *)g_adc_data, 0, sizeof(g_adc_data));

	g_wrp_adc_voltage_circle_step = EM_ADC_DELAY_STEP_VOLTAGE;

#ifdef METER_WRAPPER_ADC_COPY_REACTIVE_SAMPLE
	g_wrp_adc_voltage90_circle_step = EM_ADC_DELAY_STEP_VOLTAGE90;
#endif /* METER_WRAPPER_ADC_COPY_REACTIVE_SAMPLE */

	/* Init the HPF16 */
	RL78_InitSoftwareHPF16(EM_SW_PROPERTY_ADC_HPF_CUTOFF_FREQUENCY);
}

/******************************************************************************
 * Function Name    : void EM_ADC_Start(void)
 * Description      : Start ADC sampling
 * Arguments        : None
 * Functions Called : EM_ADC_DriverStart()
 * Return Value     : None
 ******************************************************************************/
void EM_ADC_Start(void)
{
	/* Reset SW delay and SW filter data */
	g_wrp_adc_voltage_circle_pos = 0;
#ifdef METER_WRAPPER_ADC_COPY_REACTIVE_SAMPLE
	g_wrp_adc_voltage90_circle_pos = 0;
	/* Reset linear interpolation related variables */
	g_wrp_adc_v90_lerp_t = 0;
	gp_previous_v90_r = &g_wrp_adc_voltage90_circle_phase_r[0];
	gp_previous_v90_y = &g_wrp_adc_voltage90_circle_phase_y[0];
	gp_previous_v90_b = &g_wrp_adc_voltage90_circle_phase_b[0];
#endif /* METER_WRAPPER_ADC_COPY_REACTIVE_SAMPLE */


	/* Clear filer buffer */
	RL78_ResetSoftwareHPF16(0);
	RL78_ResetSoftwareHPF16(1);
	RL78_ResetSoftwareHPF16(2);
	RL78_ResetSoftwareHPF16(3);
	RL78_ResetSoftwareHPF16(4);
	RL78_ResetSoftwareHPF16(5);

	/* Clear DSCL Filter */
	R_DSCL_IIRBiquad_i32i32_Reset_1(0);
	R_DSCL_IIRBiquad_i32i32_Reset_1(1);
	R_DSCL_IIRBiquad_i32i32_Reset_1(2);
	R_DSCL_IIRBiquad_i32i32_Reset_2(0);
	R_DSCL_IIRBiquad_i32i32_Reset_2(1);
	R_DSCL_IIRBiquad_i32i32_Reset_2(2);

	/* Start ADC HW Module */
	R_DTCD0_Start();
	R_TAU0_Channel1_Start();
	R_12ADC_Start();
	R_DSADC_Start();
}

/******************************************************************************
 * Function Name    : void EM_ADC_Stop(void)
 * Description      : Stop ADC sampling
 * Arguments        : None
 * Functions Called : EM_ADC_DriverStop()
 * Return Value     : None
 ******************************************************************************/
void EM_ADC_Stop(void)
{
	/* Stop ADC HW Module */
	R_DSADC_Stop();
	R_TAU0_Channel1_Stop();
	R_12ADC_Stop();
	R_DTCD0_Stop();
}

/******************************************************************************
 * Function Name    : void EM_ADC_InterruptCallback(void)
 * Description      : ADC Interrupt Sample processing and put to following:
 *                  :    . EM_Middleware
 *                  :    . Calibration App
 * Arguments        : None
 * Functions Called : TBD
 * Return Value     : None
 ******************************************************************************/
void EM_ADC_InterruptCallback(void)
{
	/* Push MACRx registers */
	uint16_t bkup_macrh = MACRH;
	uint16_t bkup_macrl = MACRL;

	/* DSAD->SAR (for V) samples reading */
	/* Need to do first in DSAD interrupt */
	EM_ADC_Voltage_DriverRead(EM_ADC_VOL_DRIVER_CHANNEL_PHASE_R, g_wrp_adc_buffer_phase_r_v);
	EM_ADC_Voltage_DriverRead(EM_ADC_VOL_DRIVER_CHANNEL_PHASE_Y, g_wrp_adc_buffer_phase_y_v);
	EM_ADC_Voltage_DriverRead(EM_ADC_VOL_DRIVER_CHANNEL_PHASE_B, g_wrp_adc_buffer_phase_b_v);

#ifdef METER_WRAPPER_ADC_COPY_REACTIVE_SAMPLE
	/* TIMER->SAR (for V) samples reading */
	EM_ADC_Voltage90_DriverRead(EM_ADC_VOL_DRIVER_CHANNEL_PHASE_R, g_wrp_adc_buffer_phase_r_v90);
	EM_ADC_Voltage90_DriverRead(EM_ADC_VOL_DRIVER_CHANNEL_PHASE_Y, g_wrp_adc_buffer_phase_y_v90);
	EM_ADC_Voltage90_DriverRead(EM_ADC_VOL_DRIVER_CHANNEL_PHASE_B, g_wrp_adc_buffer_phase_b_v90);

	/* Linear interpolation for samples at un-settable TDR value
	 *		y = y0 + [(y1-y0) * (x-x0)/(x1-x0)]
	 *			(x0,y0): TDR step, sample ahead interpolate point
	 *			(x ,y ): TDR step, sample at point to interpolate
	 *			(x1,y1): TDR step, sample behind interpolate point
	 * This routine in DSAD calculate
	 *		y = y0 + (y1-y0)*t
	 * With t precalculated from in timer and scale up 8 bit, within [0-1] range
	 *		t = (x-x0)/(x1-x0)
	 *		(y1-y0)*t then scaled down 8 bit before addition with y0
	 * Computation is inline for 3phase
	 */
	if (g_wrp_adc_v90_lerp_t != 0)
	{
		if (TDR01 == EM_ADC_DRIVER_TAU_MAX_THRESHOLD)
		{
			*gp_previous_v90_r = (int16_t)(*gp_previous_v90_r + (((int32_t)(g_wrp_adc_buffer_phase_r_v - *gp_previous_v90_r) * g_wrp_adc_v90_lerp_t) >> 8));
			*gp_previous_v90_y = (int16_t)(*gp_previous_v90_y + (((int32_t)(g_wrp_adc_buffer_phase_y_v - *gp_previous_v90_y) * g_wrp_adc_v90_lerp_t) >> 8));
			*gp_previous_v90_b = (int16_t)(*gp_previous_v90_b + (((int32_t)(g_wrp_adc_buffer_phase_b_v - *gp_previous_v90_b) * g_wrp_adc_v90_lerp_t) >> 8));
		}
		else // (TDR01 == EM_ADC_DRIVER_TAU_MIN_THRESHOLD)
		{
			/* Interpolate between TIMER->SAR samples and DSAD->SAR samples */
			g_wrp_adc_buffer_phase_r_v90 = (int16_t)(g_wrp_adc_buffer_phase_r_v + (((int32_t)(g_wrp_adc_buffer_phase_r_v90 - g_wrp_adc_buffer_phase_r_v) * g_wrp_adc_v90_lerp_t) >> 8));
			g_wrp_adc_buffer_phase_y_v90 = (int16_t)(g_wrp_adc_buffer_phase_y_v + (((int32_t)(g_wrp_adc_buffer_phase_y_v90 - g_wrp_adc_buffer_phase_y_v) * g_wrp_adc_v90_lerp_t) >> 8));
			g_wrp_adc_buffer_phase_b_v90 = (int16_t)(g_wrp_adc_buffer_phase_b_v + (((int32_t)(g_wrp_adc_buffer_phase_b_v90 - g_wrp_adc_buffer_phase_b_v) * g_wrp_adc_v90_lerp_t) >> 8));
		}
	}
	else
	{
		/* Use TIMER->SAR samples read from register above */
	}
#endif /* METER_WRAPPER_ADC_COPY_REACTIVE_SAMPLE */

	/*  Get current samples */
	EM_ADC_DRIVER_CURRENT_READ_ALL();

	EM_ADC_DoNoisyBitMasking();

	/* Do phase delay: for all voltage channels */
	EM_ADC_DoPhaseDelayAllVoltage();

	/* Do phase delay: for all current channels */
	EM_ADC_DoPhaseDelayAllCurrent();

	/* Do HPF to maintain the response with I channel + Copy the voltage signal to output buffer */
	/* Substract with fixed signal offset of bias voltage for faster response */
	g_wrp_adc_samples.phase_r.v =
			g_wrp_adc_buffer_phase_r_v = RL78_DoSoftwareHPF16(g_wrp_adc_buffer_phase_r_v- EM_CALIB_DEFAULT_OFFSET_V, 0);

	g_wrp_adc_samples.phase_y.v =
			g_wrp_adc_buffer_phase_y_v = RL78_DoSoftwareHPF16(g_wrp_adc_buffer_phase_y_v- EM_CALIB_DEFAULT_OFFSET_V, 1);

	g_wrp_adc_samples.phase_b.v =
			g_wrp_adc_buffer_phase_b_v = RL78_DoSoftwareHPF16(g_wrp_adc_buffer_phase_b_v- EM_CALIB_DEFAULT_OFFSET_V, 2);

#ifdef METER_WRAPPER_ADC_COPY_REACTIVE_SAMPLE
	g_wrp_adc_samples.phase_r.v90 =
			g_wrp_adc_buffer_phase_r_v90 = RL78_DoSoftwareHPF16(g_wrp_adc_buffer_phase_r_v90 - EM_CALIB_DEFAULT_OFFSET_V, 3);

	g_wrp_adc_samples.phase_y.v90 =
			g_wrp_adc_buffer_phase_y_v90 = RL78_DoSoftwareHPF16(g_wrp_adc_buffer_phase_y_v90 - EM_CALIB_DEFAULT_OFFSET_V, 4);

	g_wrp_adc_samples.phase_b.v90 =
			g_wrp_adc_buffer_phase_b_v90 = RL78_DoSoftwareHPF16(g_wrp_adc_buffer_phase_b_v90 - EM_CALIB_DEFAULT_OFFSET_V, 5);
#endif /* METER_WRAPPER_ADC_COPY_REACTIVE_SAMPLE */

#ifdef METER_WRAPPER_ADC_COPY_FUNDAMENTAL_SAMPLE
	/* Do the IIRBiquad to filter the input signals, put filterd signal to buffer and the sequence of fundamental samples*/

