lwray-renesas/Metrology_NPL_3Ph4W/src/rl78i1c/libwrapper/metrology/wrp_em_adc.c
	/* Run the filter on voltage channel at 3906Hz sampling frequency */
	R_DSCL_IIRBiquad_i32i32_c_nr_1(g_wrp_adc_samples.phase_r.v, &g_wrp_adc_samples.phase_r.v_fund, 0);
	R_DSCL_IIRBiquad_i32i32_c_nr_1(g_wrp_adc_samples.phase_y.v, &g_wrp_adc_samples.phase_y.v_fund, 1);
	R_DSCL_IIRBiquad_i32i32_c_nr_1(g_wrp_adc_samples.phase_b.v, &g_wrp_adc_samples.phase_b.v_fund, 2);

#if (METER_WRAPPER_ADC_CURRENT_CHANNEL_LPF_REDUCED_FS == 0)
	/* Run filter on current channel at 3906Hz sampling frequency, phase response matched */
	R_DSCL_IIRBiquad_i32i32_c_nr_2(g_wrp_adc_samples.phase_r.i, &g_wrp_adc_samples.phase_r.i_fund, 0);
	R_DSCL_IIRBiquad_i32i32_c_nr_2(g_wrp_adc_samples.phase_y.i, &g_wrp_adc_samples.phase_y.i_fund, 1);
	R_DSCL_IIRBiquad_i32i32_c_nr_2(g_wrp_adc_samples.phase_b.i, &g_wrp_adc_samples.phase_b.i_fund, 2);
	g_wrp_adc_samples.status.fund_sequence = EM_SW_FUND_SEQUENCE_PHASE_ALL;

#elif (METER_WRAPPER_ADC_CURRENT_CHANNEL_LPF_REDUCED_FS == 1)
	/* Run the filter on current channel at 1302Hz sampling frequency, need to do phase matching on wrapper */
	switch (g_wrp_adc_samples.status.fund_sequence)
	{
	case EM_SW_FUND_SEQUENCE_PHASE_B:
		R_DSCL_IIRBiquad_i32i32_c_nr_2(g_wrp_adc_samples.phase_r.i, &g_wrp_adc_samples.phase_r.i_fund, 0);
		g_wrp_adc_samples.status.fund_sequence = EM_SW_FUND_SEQUENCE_PHASE_R;
		break;
	case EM_SW_FUND_SEQUENCE_PHASE_R:
		R_DSCL_IIRBiquad_i32i32_c_nr_2(g_wrp_adc_samples.phase_y.i, &g_wrp_adc_samples.phase_y.i_fund, 1);
		g_wrp_adc_samples.status.fund_sequence = EM_SW_FUND_SEQUENCE_PHASE_Y;
		break;
	case EM_SW_FUND_SEQUENCE_PHASE_Y:
		R_DSCL_IIRBiquad_i32i32_c_nr_2(g_wrp_adc_samples.phase_b.i, &g_wrp_adc_samples.phase_b.i_fund, 2);
		g_wrp_adc_samples.status.fund_sequence = EM_SW_FUND_SEQUENCE_PHASE_B;
		break;
	default:
		g_wrp_adc_samples.status.fund_sequence = EM_SW_FUND_SEQUENCE_PHASE_B;
		break;
	}
#endif /* METER_WRAPPER_ADC_CURRENT_CHANNEL_LPF_REDUCED_FS */
#endif /* METER_WRAPPER_ADC_COPY_FUNDAMENTAL_SAMPLE */

	/* Debug the signal */
#ifdef __DEBUG
#ifndef METER_ENABLE_MEASURE_CPU_LOAD
	if (g_wrp_sample_count < EM_ADC_MAX_DEBUG_SAMPLE)
	{
		g_wrp_sample_int16[0][g_wrp_sample_count] = g_wrp_adc_samples.phase_r.v;
		g_wrp_sample_int16[1][g_wrp_sample_count] = g_wrp_adc_samples.phase_y.v;
		g_wrp_sample_int16[2][g_wrp_sample_count] = g_wrp_adc_samples.phase_b.v;
		g_wrp_sample_int16[3][g_wrp_sample_count] = g_wrp_adc_samples.phase_r.v90;
		g_wrp_sample_int16[4][g_wrp_sample_count] = g_wrp_adc_samples.phase_y.v90;
		g_wrp_sample_int16[5][g_wrp_sample_count] = g_wrp_adc_samples.phase_b.v90;

		g_wrp_sample_int32[0][g_wrp_sample_count] = g_wrp_adc_samples.phase_r.i;
		g_wrp_sample_int32[1][g_wrp_sample_count] = g_wrp_adc_samples.phase_y.i;
		g_wrp_sample_int32[2][g_wrp_sample_count] = g_wrp_adc_samples.phase_b.i;
		g_wrp_sample_int32[3][g_wrp_sample_count] = g_wrp_adc_samples.neutral.i;

#ifdef LPF_TEST
		/* Low Pass Filter*/
		voltage_previous = voltage;
		voltage = ((g_wrp_adc_samples.phase_r.v * 8)/alpha) + ((voltage_previous * 8)/one_minus_alpha);
		g_wrp_sample_vr_int16_lpf[g_wrp_sample_count] = voltage;

		/* only run the algorithm if the zero-cross GPIO timer is not running*/
		if(0U == timer_running)
		{
			if((voltage > 0) && (voltage < voltage_previous))
			{
				/* Positive quarter cycle falling*/
				direction = 1U;
			}
			else if((voltage < 0) && (voltage > voltage_previous))
			{
				/* Negative quarter cycle rising*/
				direction = 2U;
			}
			else
			{
				/* Don't care*/
				direction = 0U;
			}

			if(direction != 0U)
			{
				/* Get the absolute values of the filtered voltages*/
				abs_voltage = (voltage > 0) ? voltage : (-1 * voltage);
				abs_voltage_previous = (voltage_previous > 0) ? voltage_previous : (-1 * voltage_previous);

				/* Run algorithm*/
				if((abs_voltage < 6000) && (abs_voltage > 3000))
				{
					/* Calculate gradient in linear region*/
					gradient += (abs_voltage - abs_voltage_previous);
					++gradient_count;
				}
				else if((abs_voltage <= 3000) && (gradient_count > 0))
				{
					/* Calculate micro-seconds until next zero-cross event*/
					gradient += (abs_voltage - abs_voltage_previous);
					++gradient_count;
					gradient /= gradient_count; /* The average value we change every 256uS*/
					gradient = (gradient > 0) ? gradient : (-1 * gradient);
					us_to_next_zc = (abs_voltage * 256) / gradient;

					timer_running = 1U;
					saved_direction = direction;

					/* Compensate for filtering delays ~260uS for LPF TODO: Review if we need it to be larger for HPF compensation*/
					final_delay = (uint16_t)us_to_next_zc - 260U;

					/* Fire the delay counter*/
					R_TAU0_Channel3_Start_value(final_delay);

					/* Reset the gradient in preparation*/
					gradient = 0;
					gradient_count = 0;
				}
				else
				{
					/* Do Nothing*/
				}
			}
		}
#endif

		g_wrp_sample_count++;
	}
	else
	{
		voltage_previous = voltage = g_wrp_adc_samples.phase_r.v;
	}
#endif /* METER_ENABLE_MEASURE_CPU_LOAD */
#endif /* __DEBUG */

	/*
	 * METROLOGY AND EXTERNAL APPLICATION PROCESSING:
	 * The sample is ready. Put it to each application need
	 */
	if (R_CALIB_IsInCalibMode() == 0)
	{
		{
			/* Normal processing */
			EM_ADC_IntervalProcessing(&g_wrp_adc_samples);
		}
	}
	else
	{
		/* Calibration processing */
		R_CALIB_Sampling(&g_wrp_adc_samples);
	}

	/* Pop MACRx registers */
	MACRH = bkup_macrh;
	MACRL = bkup_macrl;
}

/******************************************************************************
 * Function Name    : void EM_ADC_GainPhaseReset(EM_LINE line)
 * Description      : Reset phase gain to lowest level
 * Arguments        : None
 * Functions Called : None
 * Return Value     : None
 ******************************************************************************/
void EM_ADC_GainPhaseReset(EM_LINE line)
{
	g_EM_ADC_GainPhaseCurrentLevel[line] = 0;       /* Lowest */
	/* Apply gain */
	EM_ADC_SetGainEnum(line, g_wrp_adc_channel_gain[line][g_EM_ADC_GainPhaseCurrentLevel[line]]);
}

/******************************************************************************
 * Function Name    : void EM_ADC_GainPhaseIncrease(void)
 * Description      : Increase phase gain 1 level & set the gain level to port
 * Arguments        : None
 * Functions Called : EM_ADC_GainPhaseSet()
 * Return Value     : None
 ******************************************************************************/
void EM_ADC_GainPhaseIncrease(EM_LINE line)
{
	if (g_EM_ADC_GainPhaseCurrentLevel[line] >= EM_GAIN_PHASE_NUM_LEVEL_MAX-1)  /* Is highest gain? */
	{
		return; /* Do nothing */
	}
	else    /* Still exist higher gain */
	{
		g_EM_ADC_GainPhaseCurrentLevel[line]++; /* Increase level count */
		/* Apply gain */
		EM_ADC_SetGainEnum(line, g_wrp_adc_channel_gain[line][g_EM_ADC_GainPhaseCurrentLevel[line]]);
	}
}

