lwray-renesas/Metrology_NPL_3Ph4W/src/rl78i1c/libwrapper/metrology/wrp_em_adc.c
/******************************************************************************
 * Function Name    : void EM_ADC_GainPhaseDecrease(void)
 * Description      : Decrease phase gain 1 level & set the gain level to port
 * Arguments        : None
 * Functions Called : EM_ADC_GainPhaseSet()
 * Return Value     : None
 ******************************************************************************/
void EM_ADC_GainPhaseDecrease(EM_LINE line)
{
	if (g_EM_ADC_GainPhaseCurrentLevel[line] == 0)  /* Is lowest gain? */
	{
		return; /* Do nothing */
	}
	else    /* Still exist lower gain */
	{
		g_EM_ADC_GainPhaseCurrentLevel[line]--; /* Decrease level count */
		/* Apply gain */
		EM_ADC_SetGainEnum(line, g_wrp_adc_channel_gain[line][g_EM_ADC_GainPhaseCurrentLevel[line]]);
	}
}

/******************************************************************************
 * Function Name    : uint8_t EM_ADC_GainPhaseGetLevel(void)
 * Description      : Get the current phase gain level
 * Arguments        : None
 * Functions Called : None
 * Return Value     : None
 ******************************************************************************/
uint8_t EM_ADC_GainPhaseGetLevel(EM_LINE line)
{
	return g_EM_ADC_GainPhaseCurrentLevel[line];
}

/******************************************************************************
 * Function Name    : void EM_ADC_SetPhaseCorrection(EM_LINE line, dsad_channel_t channel, float32_t degree)
 * Description      : Core function to set phase correction
 * Arguments        : EM_LINE line           : phase selection
 *                  : dsad_channel_t channel : DSAD channel of selected phase
 *                  : float32_t degree       : degree to compensate
 * Functions Called : R_DSADC_AdjustPhaseDelay
 * Return Value     : None
 ******************************************************************************/
void EM_ADC_SetPhaseCorrection(EM_LINE line, float32_t degree)
{
	degree = (degree < 0.0f) ? -degree : degree;

	switch (line)
	{
	case LINE_PHASE_R:
		EM_ADC_DriverSetPhaseStep(
				EM_ADC_CURRENT_DRIVER_CHANNEL_PHASE_R,
				(uint16_t)(degree / EM_ADC_DRIVER_PHASE_SHIFT_STEP)
		);
		break;
	case LINE_PHASE_Y:
		EM_ADC_DriverSetPhaseStep(
				EM_ADC_CURRENT_DRIVER_CHANNEL_PHASE_Y,
				(uint16_t)(degree / EM_ADC_DRIVER_PHASE_SHIFT_STEP)
		);
		break;
	case LINE_PHASE_B:
		EM_ADC_DriverSetPhaseStep(
				EM_ADC_CURRENT_DRIVER_CHANNEL_PHASE_B,
				(uint16_t)(degree / EM_ADC_DRIVER_PHASE_SHIFT_STEP)
		);
		break;
	case LINE_NEUTRAL:
		EM_ADC_DriverSetPhaseStep(
				EM_ADC_CURRENT_DRIVER_CHANNEL_NEUTRAL,
				(uint16_t)(degree / EM_ADC_DRIVER_PHASE_SHIFT_STEP)
		);
		break;
	default:
		break;
	}
}

/******************************************************************************
 * Function Name    : void EM_ADC_SAMP_UpdateStep(float32_t fac)
 * Description      : Update the step delay into sw delay circle and hw timer delay
 * Arguments        : float32_t fac: measured line frequency
 * Functions Called : EM_ADC_QuarterShiftTimer_LookupValue(): lookup timer value
 *                  : R_TAU0_Channel1_SetValue(): set TDR value
 * Return Value     : None
 ******************************************************************************/
void EM_ADC_SAMP_UpdateStep(float32_t fac)
{
#ifdef METER_WRAPPER_ADC_COPY_REACTIVE_SAMPLE
	/* Update software integer  */
	uint8_t     sw_delay_steps;
	float32_t   fsteps, total_steps;
	int16_t     tdr_value, lerp_t;

	/* Delay frequency updating */
	if (fac == g_previous_fac)
	{
		g_fac_update_counter = 0;
		return;
	}
	else
	{
		g_fac_update_counter++;
		if (g_fac_update_counter < EM_FAC_CHANGED_DETECTION_COUNT)
		{
			return;
		}
		else
		{
			g_previous_fac = fac;
			g_fac_update_counter = 0;
			/* Update by below routine */
		}
	}

	/*
	 *                                  90.0f * fs
	 * Calculate ideal total step: = -----------------
	 *                                 fac * 360.0f
	 */

	total_steps = ((90.0f/360.0f) * EM_GetCalibInfo().sampling_frequency)/ (fac);

	sw_delay_steps = (uint8_t)total_steps;

	/* Reverse the fsteps as required */
	fsteps = 1.0f - (total_steps - sw_delay_steps);

	/* Increase 1 step software delay for subtraction of TDR sample + DSAD->SAR voltage sample delay steps  */
	sw_delay_steps += 1 + EM_ADC_DELAY_STEP_VOLTAGE;

	tdr_value = (int16_t)(fsteps * (float32_t)EM_ADC_DRIVER_TAU_256US_SETTING);

	/* Record intermediate data (for checking only) */
	g_wrp_adc_calculated_tdr = tdr_value;

	/* Precalculate linear interpolation t constant and limit TDR setting to max or min
	 * 	t = (x-x0)/(x1-x0)
	 * 		Both range:
	 *  		EM_ADC_DRIVER_TAU_MIN_THRESHOLD to 0
	 *  		EM_ADC_DRIVER_TAU_256US_SETTING to EM_ADC_DRIVER_TAU_MAX_THRESHOLD
	 * 		Currently the same on 512k, but it considered more meaningful to use separate calculation
	 * 	Limit TDR setting to max or min and used TIMER->SAR sample as one point in linear interpolation
	 */
	if (tdr_value > EM_ADC_DRIVER_TAU_MAX_THRESHOLD)
	{
		lerp_t = (int16_t)(((int32_t)(tdr_value - EM_ADC_DRIVER_TAU_MAX_THRESHOLD) << 8) / (EM_ADC_DRIVER_TAU_256US_SETTING - EM_ADC_DRIVER_TAU_MAX_THRESHOLD));
		tdr_value = EM_ADC_DRIVER_TAU_MAX_THRESHOLD;
	}
	else if (tdr_value < EM_ADC_DRIVER_TAU_MIN_THRESHOLD)
	{
		lerp_t = (int16_t)(((int32_t)(tdr_value - 0) << 8) / (EM_ADC_DRIVER_TAU_MIN_THRESHOLD - 0));
		tdr_value = EM_ADC_DRIVER_TAU_MIN_THRESHOLD;
	}
	else
	{
		/* Within settable TDR range, use V90 sample with calculated tdr value */
		lerp_t = 0;
	}

	/* Make sure steps still within maximum buffer length */
	if (sw_delay_steps > EM_ADC_DELAY_VOLTAGE90_MAX_STEP)
	{
		/* Abnormal: out of buffer range, limit the buffer length */
		sw_delay_steps = EM_ADC_DELAY_VOLTAGE90_MAX_STEP;
	}
	else
	{
		/* SW delay steps within buffer size, no need to change */
	}

	/* Control timer delay, convert to us */
	R_TAU0_Channel1_SetValue(tdr_value);

	/* Apply new circle delay step and interpolation t constant */
	g_wrp_adc_voltage90_circle_step = sw_delay_steps;
	g_wrp_adc_v90_lerp_t = lerp_t;

#endif /* METER_WRAPPER_ADC_COPY_REACTIVE_SAMPLE */
}
